# Just starting out here
This is my first notebook and I am doing it with Craig Nathaniel Gorton

In [7]:
import pandas as pd

In [16]:
my_data = pd.read_csv('Data.csv', index_col = 'id')
my_data

       name  age  gpa  coolio
id
1    Hannah   17  4.0    True
2     Craig   70  2.0   False
3   Whidbey    5  5.0    True

In [17]:
my_data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 3 entries, 1 to 3
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    3 non-null      object
 1   age     3 non-null      int64
 2   gpa     3 non-null      float64
 3   coolio  3 non-null      bool
dtypes: bool(1), float64(1), int64(1), object(1)
memory usage: 99.0+ bytes

In [18]:
my_data.describe()

             age       gpa
count   3.000000  3.000000
mean   30.666667  3.666667
std    34.588052  1.527525
min     5.000000  2.000000
25%    11.000000  3.000000
50%    17.000000  4.000000
75%    43.500000  4.500000
max    70.000000  5.000000

In [43]:
my_data.loc[,['name','gpa']]

NameError: name 'df' is not defined